<a href="https://colab.research.google.com/github/SDB016/Study/blob/main/python/pandas/Application_of_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

**CSV파일 불러오기**

In [2]:
df = pd.read_csv('./data.csv', encoding='euc-kr')

**살펴보기**

In [ ]:
df.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [ ]:
df.tail()

     지역명               규모구분    연도  월 분양가격(㎡)
4585  제주                 전체  2020  3    3955
4586  제주         전용면적 60㎡이하  2020  3    4039
4587  제주   전용면적 60㎡초과 85㎡이하  2020  3    3962
4588  제주  전용면적 85㎡초과 102㎡이하  2020  3     NaN
4589  제주        전용면적 102㎡초과  2020  3    3601

**COLUMN 이름 바꾸기**

In [ ]:
df=df.rename(columns={'분양가격(㎡)':'분양가'})
df.head()

  지역명               규모구분    연도   월   분양가
0  서울                 전체  2015  10  5841
1  서울         전용면적 60㎡이하  2015  10  5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10  5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10  5721
4  서울        전용면적 102㎡초과  2015  10  5879

**Data Type 보기**

In [ ]:
df.dtypes

지역명     object
규모구분    object
연도       int64
월        int64
분양가     object
dtype: object

In [ ]:
df['분양가'] = df['분양가'].apply(pd.to_numeric, errors = 'coerce')
df.dtypes
df.head()

  지역명               규모구분    연도   월     분양가
0  서울                 전체  2015  10  5841.0
1  서울         전용면적 60㎡이하  2015  10  5652.0
2  서울   전용면적 60㎡초과 85㎡이하  2015  10  5882.0
3  서울  전용면적 85㎡초과 102㎡이하  2015  10  5721.0
4  서울        전용면적 102㎡초과  2015  10  5879.0

**Numpy array로 변환**

In [ ]:
arr = df.to_numpy()
arr

array([['서울', '전체', 2015, 10, 5841.0],
       ['서울', '전용면적 60㎡이하', 2015, 10, 5652.0],
       ['서울', '전용면적 60㎡초과 85㎡이하', 2015, 10, 5882.0],
       ...,
       ['제주', '전용면적 60㎡초과 85㎡이하', 2020, 3, 3962.0],
       ['제주', '전용면적 85㎡초과 102㎡이하', 2020, 3, nan],
       ['제주', '전용면적 102㎡초과', 2020, 3, 3601.0]], dtype=object)

In [ ]:
len(arr)

4590

In [ ]:
print(arr[0], arr[1])

['서울' '전체' 2015 10 5841.0] ['서울' '전용면적 60㎡이하' 2015 10 5652.0]

In [ ]:
print(arr[0][0])

서울

**간단한 통계**

In [ ]:
df.describe()

                연도            월           분양가
count  4590.000000  4590.000000   4260.000000
mean   2017.500000     6.500000   3270.160798
std       1.343856     3.594368   1300.362742
min    2015.000000     1.000000   1868.000000
25%    2016.000000     3.000000   2454.750000
50%    2017.500000     6.500000   2890.000000
75%    2019.000000    10.000000   3601.000000
max    2020.000000    12.000000  13835.000000

**축 변환하기**

In [ ]:
df.T.head()

      0           1     ...               4588         4589
지역명     서울          서울  ...                 제주           제주
규모구분    전체  전용면적 60㎡이하  ...  전용면적 85㎡초과 102㎡이하  전용면적 102㎡초과
연도    2015        2015  ...               2020         2020
월       10          10  ...                  3            3
분양가   5841        5652  ...                NaN         3601

[5 rows x 4590 columns]

**Index 정렬**

In [ ]:
#내림차순
a = df.sort_index(axis=0, ascending=False)
a.head()

     지역명               규모구분    연도  월     분양가
4589  제주        전용면적 102㎡초과  2020  3  3601.0
4588  제주  전용면적 85㎡초과 102㎡이하  2020  3     NaN
4587  제주   전용면적 60㎡초과 85㎡이하  2020  3  3962.0
4586  제주         전용면적 60㎡이하  2020  3  4039.0
4585  제주                 전체  2020  3  3955.0

In [ ]:
#오름차순
b = df.sort_index(axis=0, ascending=True)
b.head()

  지역명               규모구분    연도   월     분양가
0  서울                 전체  2015  10  5841.0
1  서울         전용면적 60㎡이하  2015  10  5652.0
2  서울   전용면적 60㎡초과 85㎡이하  2015  10  5882.0
3  서울  전용면적 85㎡초과 102㎡이하  2015  10  5721.0
4  서울        전용면적 102㎡초과  2015  10  5879.0

**Value 정렬**

In [ ]:
df.sort_values(by='분양가', ascending=False)

     지역명               규모구분    연도   월      분양가
4508  서울  전용면적 85㎡초과 102㎡이하  2020   3  13835.0
4423  서울  전용면적 85㎡초과 102㎡이하  2020   2  13835.0
4253  서울  전용면적 85㎡초과 102㎡이하  2019  12  12728.0
3998  서울  전용면적 85㎡초과 102㎡이하  2019   9  12728.0
4083  서울  전용면적 85㎡초과 102㎡이하  2019  10  12728.0
...   ..                ...   ...  ..      ...
4546  세종         전용면적 60㎡이하  2020   3      NaN
4553  강원  전용면적 85㎡초과 102㎡이하  2020   3      NaN
4578  경북  전용면적 85㎡초과 102㎡이하  2020   3      NaN
4584  경남        전용면적 102㎡초과  2020   3      NaN
4588  제주  전용면적 85㎡초과 102㎡이하  2020   3      NaN

[4590 rows x 5 columns]

**Label로 선택**

In [ ]:
df.loc[:, ['지역명', '연도']][:7]

  지역명    연도
0  서울  2015
1  서울  2015
2  서울  2015
3  서울  2015
4  서울  2015
5  인천  2015
6  인천  2015

In [ ]:
df.loc[:6 ,['지역명', '연도']]

  지역명    연도
0  서울  2015
1  서울  2015
2  서울  2015
3  서울  2015
4  서울  2015
5  인천  2015
6  인천  2015

In [ ]:
df.loc[df.index > 5, ['지역명', '연도']][:10]

   지역명    연도
6   인천  2015
7   인천  2015
8   인천  2015
9   인천  2015
10  경기  2015
11  경기  2015
12  경기  2015
13  경기  2015
14  경기  2015
15  부산  2015

In [ ]:
df.loc[(df['지역명']=='인천') & (df['연도']==2018),['지역명', '연도', '분양가']].sort_values(by='분양가', ascending=False)[:10]

     지역명    연도     분양가
2644  인천  2018  4835.0
2389  인천  2018  4835.0
2559  인천  2018  4835.0
2304  인천  2018  4835.0
2474  인천  2018  4835.0
3154  인천  2018  4455.0
3239  인천  2018  4455.0
2471  인천  2018  3754.0
2556  인천  2018  3754.0
3237  인천  2018  3731.0

In [ ]:
df.iloc[2, 1]

'전용면적 60㎡초과 85㎡이하'

In [ ]:
# df.iloc과 동작방식은 동일하지만, 범위 지정은 불가
df.iat[2, 1]

'전용면적 60㎡초과 85㎡이하'

In [ ]:
df.iloc[2, :]

지역명                      서울
규모구분       전용면적 60㎡초과 85㎡이하
연도                     2015
월                        10
분양가격(㎡)                5882
Name: 2, dtype: object

In [ ]:
# iloc으로 인덱스 지정시 : 기준으로 왼쪽은 포함, : 기준으로 오른쪽은 미만
df.iloc[:5, 1:3]

                규모구분    연도
0                 전체  2015
1         전용면적 60㎡이하  2015
2   전용면적 60㎡초과 85㎡이하  2015
3  전용면적 85㎡초과 102㎡이하  2015
4        전용면적 102㎡초과  2015

In [ ]:
df[df.연도 == 2019][:5]

     지역명               규모구분    연도  월 분양가격(㎡)
3315  서울                 전체  2019  1    7600
3316  서울         전용면적 60㎡이하  2019  1    7400
3317  서울   전용면적 60㎡초과 85㎡이하  2019  1    8105
3318  서울  전용면적 85㎡초과 102㎡이하  2019  1    6842
3319  서울        전용면적 102㎡초과  2019  1    7787

In [ ]:
copy = df.copy()
copy.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [ ]:
# 지역명 == 서울 인 지역만 선택
df.loc[df['지역명']=='서울','지역명'][:10]

0     서울
1     서울
2     서울
3     서울
4     서울
85    서울
86    서울
87    서울
88    서울
89    서울
Name: 지역명, dtype: object

In [ ]:
# 지역명 == 서울 인 지역을 Seoul로 변경(값을 set)
df.loc[df['지역명']=='서울','지역명'] = 'Seoul'
df.head()

     지역명               규모구분    연도   월 분양가격(㎡)
0  Seoul                 전체  2015  10    5841
1  Seoul         전용면적 60㎡이하  2015  10    5652
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  Seoul        전용면적 102㎡초과  2015  10    5879

In [ ]:
df1 = df.reindex(index=df.index[:7], columns=list(df.columns) + ['extra'])
df1

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841    NaN
1  Seoul         전용면적 60㎡이하  2015  10    5652    NaN
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882    NaN
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721    NaN
4  Seoul        전용면적 102㎡초과  2015  10    5879    NaN
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [ ]:
df1.loc[:4, 'extra'] = False
df1

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [ ]:
df2 = df1.copy()
df2

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163    NaN
6     인천         전용면적 60㎡이하  2015  10    3488    NaN

In [ ]:
df2.dropna(how='any')

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False

In [ ]:
#원본 데이터에 반영
df2.dropna(how='any', inplace=True)
df2

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False

In [ ]:
df2 = df1.copy()
df2.fillna(value=True)

     지역명               규모구분    연도   월 분양가격(㎡)  extra
0  Seoul                 전체  2015  10    5841  False
1  Seoul         전용면적 60㎡이하  2015  10    5652  False
2  Seoul   전용면적 60㎡초과 85㎡이하  2015  10    5882  False
3  Seoul  전용면적 85㎡초과 102㎡이하  2015  10    5721  False
4  Seoul        전용면적 102㎡초과  2015  10    5879  False
5     인천                 전체  2015  10    3163   True
6     인천         전용면적 60㎡이하  2015  10    3488   True

In [ ]:
pd.isna(df2)

     지역명   규모구분     연도      월  분양가격(㎡)  extra
0  False  False  False  False    False  False
1  False  False  False  False    False  False
2  False  False  False  False    False  False
3  False  False  False  False    False  False
4  False  False  False  False    False  False
5  False  False  False  False    False   True
6  False  False  False  False    False   True

In [ ]:
df.mean() #df.mean(0)

연도    2017.5
월        6.5
dtype: float64

In [ ]:
df.mean(1)[:5]

0    1012.5
1    1012.5
2    1012.5
3    1012.5
4    1012.5
dtype: float64

In [ ]:
df.shift(2)[:5]

     지역명              규모구분      연도     월 분양가격(㎡)
0    NaN               NaN     NaN   NaN     NaN
1    NaN               NaN     NaN   NaN     NaN
2  Seoul                전체  2015.0  10.0    5841
3  Seoul        전용면적 60㎡이하  2015.0  10.0    5652
4  Seoul  전용면적 60㎡초과 85㎡이하  2015.0  10.0    5882

In [ ]:
df.shift(-2)[:5]

     지역명               규모구분      연도     월 분양가격(㎡)
0  Seoul   전용면적 60㎡초과 85㎡이하  2015.0  10.0    5882
1  Seoul  전용면적 85㎡초과 102㎡이하  2015.0  10.0    5721
2  Seoul        전용면적 102㎡초과  2015.0  10.0    5879
3     인천                 전체  2015.0  10.0    3163
4     인천         전용면적 60㎡이하  2015.0  10.0    3488

In [ ]:
df1 = df[['연도', '월']]
df1.shape

(4590, 2)

In [ ]:
s = np.ones(df.shape[0])
s.shape

(4590,)

In [ ]:
df1.head()

     연도   월
0  2015  10
1  2015  10
2  2015  10
3  2015  10
4  2015  10

In [ ]:
#칼럼씩 빼기
df1.sub(s, axis=0).head()

       연도    월
0  2014.0  9.0
1  2014.0  9.0
2  2014.0  9.0
3  2014.0  9.0
4  2014.0  9.0

출처: https://teddylee777.github.io/pandas/10minutes-to-pandas-%EB%B6%80%EB%8F%99%EC%82%B0%EC%8B%A4%EC%A0%9C%EB%8D%B0%EC%9D%B4%ED%84%B0-%ED%99%9C%EC%9A%A9%ED%95%98%EA%B8%B0

In [ ]:
#index씩 빼기
s = np.ones(df1.shape[1])
df1.sub(s, axis=1).head()

       연도    월
0  2014.0  9.0
1  2014.0  9.0
2  2014.0  9.0
3  2014.0  9.0
4  2014.0  9.0

In [ ]:
df1.apply(np.cumsum)[:10]

      연도    월
0   2015   10
1   4030   20
2   6045   30
3   8060   40
4  10075   50
5  12090   60
6  14105   70
7  16120   80
8  18135   90
9  20150  100

In [ ]:
df1.apply(lambda x: x.max() - x.min())

연도     5
월     11
dtype: int64

In [ ]:
df1['연도'].value_counts()

2019    1020
2018    1020
2017    1020
2016    1020
2015     255
2020     255
Name: 연도, dtype: int64

In [ ]:
df['규모구분'].value_counts()

전용면적 85㎡초과 102㎡이하    918
전용면적 60㎡이하           918
전체                   918
전용면적 60㎡초과 85㎡이하     918
전용면적 102㎡초과          918
Name: 규모구분, dtype: int64

# **데이터 합치기**

In [3]:
left = df[['연도','월']]
left.head()

     연도   월
0  2015  10
1  2015  10
2  2015  10
3  2015  10
4  2015  10

In [4]:
right = df[['지역명']]
right.head()

  지역명
0  서울
1  서울
2  서울
3  서울
4  서울

In [12]:
part_1 = pd.DataFrame(np.random.randn(3, 4))
part_2 = pd.DataFrame(np.random.randn(4, 4))
part_3 = pd.DataFrame(np.random.randn(5, 4))
part_1

          0         1         2         3
0  0.446112 -0.434943 -0.168812 -2.965218
1 -0.646984  0.064033  0.124353  0.830755
2 -0.631951 -0.892959  0.827009  1.019573

In [6]:
part_2

          0         1         2         3
0 -0.404629 -1.655971 -1.469488 -0.981258
1  0.307672 -0.277510  0.411932  0.783603
2 -2.542988  1.275894 -0.811368 -0.063239
3  0.731844 -1.483220  0.821985  0.653538

In [7]:
part_3

          0         1         2         3
0  0.885520  0.286530  0.564793  0.228716
1 -0.013625 -0.568706 -1.446307 -0.459285
2 -1.752861 -0.259119  0.950411  0.883517
3 -1.156289 -0.729210  0.876569  0.427151
4 -1.911281 -0.652862  0.636530 -1.507586

In [8]:
part = [part_1, part_2, part_3]
part

[          0         1         2         3
 0 -0.716703 -0.487299 -0.208889  1.281312
 1 -0.538351  0.624804  1.165158 -2.144821
 2 -0.693270  0.006867  0.310287  0.793866,
           0         1         2         3
 0 -0.404629 -1.655971 -1.469488 -0.981258
 1  0.307672 -0.277510  0.411932  0.783603
 2 -2.542988  1.275894 -0.811368 -0.063239
 3  0.731844 -1.483220  0.821985  0.653538,
           0         1         2         3
 0  0.885520  0.286530  0.564793  0.228716
 1 -0.013625 -0.568706 -1.446307 -0.459285
 2 -1.752861 -0.259119  0.950411  0.883517
 3 -1.156289 -0.729210  0.876569  0.427151
 4 -1.911281 -0.652862  0.636530 -1.507586]

In [9]:
pd.concat(part)

          0         1         2         3
0 -0.716703 -0.487299 -0.208889  1.281312
1 -0.538351  0.624804  1.165158 -2.144821
2 -0.693270  0.006867  0.310287  0.793866
0 -0.404629 -1.655971 -1.469488 -0.981258
1  0.307672 -0.277510  0.411932  0.783603
2 -2.542988  1.275894 -0.811368 -0.063239
3  0.731844 -1.483220  0.821985  0.653538
0  0.885520  0.286530  0.564793  0.228716
1 -0.013625 -0.568706 -1.446307 -0.459285
2 -1.752861 -0.259119  0.950411  0.883517
3 -1.156289 -0.729210  0.876569  0.427151
4 -1.911281 -0.652862  0.636530 -1.507586

In [13]:
left = pd.DataFrame({'연도': ['2015', '2016', '2017', '2018', '2019'], '월': ['1', '2', '3', '4', '5']})
left

     연도  월
0  2015  1
1  2016  2
2  2017  3
3  2018  4
4  2019  5

In [14]:
right = pd.DataFrame({'이름': ['홍길동', '김영희', '이철수', '방탄소년단', 'QUEEN'], '월': ['1', '2', '3', '4', '5']})
right

      이름  월
0    홍길동  1
1    김영희  2
2    이철수  3
3  방탄소년단  4
4  QUEEN  5

In [15]:
left.shape, right.shape

((5, 2), (5, 2))

In [16]:
pd.merge(left, right, on='월')

     연도  월     이름
0  2015  1    홍길동
1  2016  2    김영희
2  2017  3    이철수
3  2018  4  방탄소년단
4  2019  5  QUEEN

In [17]:
left = pd.DataFrame({'연도': ['2015', '2016', '2017', '2018', '2019'], '월': ['1', '1', '3', '4', '5']})
left

     연도  월
0  2015  1
1  2016  1
2  2017  3
3  2018  4
4  2019  5

In [18]:
right = pd.DataFrame({'이름': ['홍길동', '김영희', '이철수', '방탄소년단', 'QUEEN'], '월': ['1', '1', '3', '4', '5']})
right

      이름  월
0    홍길동  1
1    김영희  1
2    이철수  3
3  방탄소년단  4
4  QUEEN  5

In [19]:
pd.merge(left, right, on='월')

     연도  월     이름
0  2015  1    홍길동
1  2015  1    김영희
2  2016  1    홍길동
3  2016  1    김영희
4  2017  3    이철수
5  2018  4  방탄소년단
6  2019  5  QUEEN

In [20]:
test = np.arange(0, 50)
test

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49])

In [22]:
test = test.reshape(10, 5)
test

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34],
       [35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44],
       [45, 46, 47, 48, 49]])

In [23]:
test_1 = test[:3]
test_1

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

In [24]:
test_2 = test[3:7]
test_2

array([[15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34]])

In [25]:
df1 = pd.DataFrame(test_1)
df1

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [26]:
df2 = pd.DataFrame(test_2)
df2

    0   1   2   3   4
0  15  16  17  18  19
1  20  21  22  23  24
2  25  26  27  28  29
3  30  31  32  33  34

In [27]:
df1.append(df2)

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
0  15  16  17  18  19
1  20  21  22  23  24
2  25  26  27  28  29
3  30  31  32  33  34

In [28]:
df1.append(df2, ignore_index=True)

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29
6  30  31  32  33  34

In [31]:
df.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [40]:
df=df.rename(columns={'분양가격(㎡)':'분양가'})
df.head()

  지역명               규모구분    연도   월   분양가
0  서울                 전체  2015  10  5841
1  서울         전용면적 60㎡이하  2015  10  5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10  5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10  5721
4  서울        전용면적 102㎡초과  2015  10  5879

In [47]:
df['분양가'] = df['분양가'].apply(pd.to_numeric, errors = 'coerce')

In [58]:
dff = df.groupby(['지역명', '연도', '월'])['분양가'].agg('sum')
dff.head(30)

지역명  연도    월
강원   2015  10    10897.0
           11    10888.0
           12    10888.0
     2016  1     10894.0
           2      9013.0
           3      9014.0
           4      8816.0
           5      8669.0
           6      8678.0
           7      8648.0
           8      8705.0
           9      8690.0
           10    10608.0
           11    10383.0
           12    10752.0
     2017  1     10711.0
           2     10734.0
           3     10682.0
           4     10682.0
           5     10767.0
           6     11026.0
           7     11076.0
           8     11401.0
           9     11237.0
           10    11174.0
           11    11844.0
           12    11736.0
     2018  1     12157.0
           2     12346.0
           3     12800.0
Name: 분양가, dtype: float64

In [52]:
arr = df.to_numpy()
arr

array([['서울', '전체', 2015, 10, 5841.0],
       ['서울', '전용면적 60㎡이하', 2015, 10, 5652.0],
       ['서울', '전용면적 60㎡초과 85㎡이하', 2015, 10, 5882.0],
       ...,
       ['제주', '전용면적 60㎡초과 85㎡이하', 2020, 3, 3962.0],
       ['제주', '전용면적 85㎡초과 102㎡이하', 2020, 3, nan],
       ['제주', '전용면적 102㎡초과', 2020, 3, 3601.0]], dtype=object)

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4590 entries, 0 to 4589
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지역명     4590 non-null   object
 1   규모구분    4590 non-null   object
 2   연도      4590 non-null   int64
 3   월       4590 non-null   int64
 4   분양가     4260 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 179.4+ KB

In [62]:
grouped = df.groupby(['지역명', '연도', '월']).sum()
grouped

                 분양가
지역명 연도   월
강원  2015 10  10897.0
         11  10888.0
         12  10888.0
    2016 1   10894.0
         2    9013.0
...              ...
충북  2019 11  12086.0
         12  12092.0
    2020 1   12092.0
         2   12365.0
         3   12600.0

[918 rows x 1 columns]

In [63]:
grouped.head()

                 분양가
지역명 연도   월
강원  2015 10  10897.0
         11  10888.0
         12  10888.0
    2016 1   10894.0
         2    9013.0

In [65]:
cc = grouped.stack()
cc.head(20)

지역명  연도    월
강원   2015  10  분양가    10897.0
           11  분양가    10888.0
           12  분양가    10888.0
     2016  1   분양가    10894.0
           2   분양가     9013.0
           3   분양가     9014.0
           4   분양가     8816.0
           5   분양가     8669.0
           6   분양가     8678.0
           7   분양가     8648.0
           8   분양가     8705.0
           9   분양가     8690.0
           10  분양가    10608.0
           11  분양가    10383.0
           12  분양가    10752.0
     2017  1   분양가    10711.0
           2   분양가    10734.0
           3   분양가    10682.0
           4   분양가    10682.0
           5   분양가    10767.0
dtype: float64

In [66]:
grouped.unstack(0)

             분양가                             ...
지역명           강원       경기       경남       경북  ...       전북       제주       충남       충북
연도   월                                       ...
2015 10  10897.0  16679.0  12739.0  11027.0  ...  10864.0   9614.0  11591.0  10455.0
     11  10888.0  16494.0  12843.0  11472.0  ...  10902.0   9614.0  11410.0  10085.0
     12  10888.0  17104.0  12869.0  11429.0  ...  10554.0   9685.0  11953.0  10500.0
2016 1   10894.0  17104.0  12698.0  11406.0  ...  10534.0   9685.0  12017.0  10518.0
     2    9013.0  16831.0  12692.0  11420.0  ...  10535.0   9685.0  12035.0  10518.0
     3    9014.0  16958.0  12839.0  11532.0  ...  10382.0   4628.0  11440.0  10463.0
     4    8816.0  16848.0  13029.0  11526.0  ...  10374.0  13651.0  11803.0  10430.0
     5    8669.0  17932.0  13203.0  11534.0  ...  10400.0  13569.0  11809.0  10476.0
     6    8678.0  18269.0  13026.0  11828.0  ...  10371.0  14122.0  12048.0  10681.0
     7    8648.0  18315.0  12969.0  11828.0  ...  10402.0  14122.0  12048.0  10788.0
     8    8705.0  18250.0  12984.0  11798.0  ...  10407.0  14211.0  12167.0  10881.0
     9    8690.0  17479.0  12787.0  11812.0  ...  10410.0  16407.0  12168.0  10886.0
     10  10608.0  17852.0  12821.0  12070.0  ...  10431.0  16407.0  12159.0  11276.0
     11  10383.0  18362.0  12699.0  12076.0  ...  10430.0  16461.0  12488.0  11283.0
     12  10752.0  18254.0  12739.0  12141.0  ...  10899.0  16510.0  12513.0  11497.0
2017 1   10711.0  18260.0  12745.0  12185.0  ...  10951.0  16490.0  12448.0  11588.0
     2   10734.0  18571.0  12922.0  12183.0  ...  10947.0  16453.0  12451.0  11367.0
     3   10682.0  18838.0  12853.0  12215.0  ...  11070.0  16412.0  12453.0  11327.0
     4   10682.0  18849.0  12877.0  12311.0  ...  11192.0  18250.0  12500.0  11136.0
     5   10767.0  18200.0  12893.0  12468.0  ...  11273.0  20348.0  12499.0  11387.0
     6   11026.0  18379.0  13223.0  12513.0  ...  11414.0  20762.0  12417.0  11309.0
     7   11076.0  18630.0  13345.0  12512.0  ...  11500.0  21366.0  12420.0  11309.0
     8   11401.0  18853.0  13547.0  12864.0  ...  11509.0  21366.0  12440.0  11323.0
     9   11237.0  18872.0  14758.0  13166.0  ...   8870.0  11752.0  12440.0  11332.0
     10  11174.0  18806.0  13387.0  12922.0  ...   8752.0  11752.0  12569.0  11343.0
     11  11844.0  18484.0  13674.0  10165.0  ...   9092.0  12417.0   9215.0  11131.0
     12  11736.0  18825.0  13896.0  10165.0  ...  11354.0  15454.0   9519.0  11131.0
2018 1   12157.0  20740.0  13896.0  10268.0  ...  11354.0  15557.0   9507.0  11131.0
     2   12346.0  20954.0  13905.0  10268.0  ...  11366.0  15862.0   9507.0  11435.0
     3   12800.0  20861.0  13910.0  10174.0  ...  11345.0  16055.0   9507.0  12212.0
     4   12260.0  20891.0  13816.0  10121.0  ...  12641.0  16055.0   9507.0  12961.0
     5   12333.0  21368.0  13825.0  10574.0  ...  12720.0  16055.0   9871.0  13028.0
     6   12317.0  21249.0  13831.0  10619.0  ...  12720.0  16055.0  12623.0  12552.0
     7   12434.0  21708.0  13813.0  10702.0  ...  12780.0  12906.0  12623.0  12506.0
     8   12577.0  22203.0  13679.0  10500.0  ...  12737.0  12906.0  12774.0  12506.0
     9   12590.0  22170.0  14211.0  13177.0  ...  12737.0  12906.0  12774.0  12494.0
     10  12667.0  22191.0  14471.0  13401.0  ...  12551.0  12906.0  12774.0  12494.0
     11  12611.0  22352.0  14628.0  13492.0  ...  12564.0  16675.0  12627.0  12425.0
     12  12349.0  22557.0  15609.0  13492.0  ...  13114.0  16910.0  12603.0  12425.0
2019 1   12618.0  22750.0  15609.0  13322.0  ...  13114.0  16910.0  12773.0  12425.0
     2   12618.0  22879.0  15604.0  13430.0  ...  13229.0  16910.0  12994.0  12158.0
     3   12706.0  22696.0  15984.0  13536.0  ...  13358.0  16910.0  13113.0  12235.0
     4   13229.0  22970.0  16066.0  13464.0  ...  12566.0  17215.0  13167.0  12258.0
     5   13411.0  23825.0  16317.0  13276.0  ...  12689.0  17215.0  13257.0  12018.0
     6   13451.0  24626.0  16372.0  13276.0  ...  12689.0  17834.0   7725.0  12084.0
     7   13668.0  23783.0  16372.0  13276.0  ...  12745.0  15158.0  10737.0  11863.0
     8   13694.0  23994.0  16179.0  13658.0  ...  13030.0  15158.0  10727.0  11732.0
     9   14049.0  24342.0  13479.0  13962.0  ...  13030.0  15158.0  10399.0  11958.0
     10  14027.0  24226.0  13935.0  14450.0  ...  12916.0  15158.0  13599.0  12016.0
     11  14487.0  24305.0  16705.0  14450.0  ...  12883.0  11381.0  13599.0  12086.0
     12  14487.0  24432.0  12155.0  14450.0  ...  12883.0  11381.0  13724.0  12092.0
2020 1   14731.0  24514.0  12155.0  12170.0  ...  12883.0  15557.0  13724.0  12092.0
     2   14819.0  24373.0  12155.0  10438.0  ...  12883.0  15557.0  13651.0  12365.0
     3   11329.0  24337.0  11966.0  10438.0  ...  12883.0  15557.0  13665.0  12600.0

[54 rows x 17 columns]

In [67]:
grouped.unstack(1)

            분양가
연도         2015     2016     2017     2018     2019     2020
지역명 월
강원  1       NaN  10894.0  10711.0  12157.0  12618.0  14731.0
    2       NaN   9013.0  10734.0  12346.0  12618.0  14819.0
    3       NaN   9014.0  10682.0  12800.0  12706.0  11329.0
    4       NaN   8816.0  10682.0  12260.0  13229.0      NaN
    5       NaN   8669.0  10767.0  12333.0  13411.0      NaN
...         ...      ...      ...      ...      ...      ...
충북  8       NaN  10881.0  11323.0  12506.0  11732.0      NaN
    9       NaN  10886.0  11332.0  12494.0  11958.0      NaN
    10  10455.0  11276.0  11343.0  12494.0  12016.0      NaN
    11  10085.0  11283.0  11131.0  12425.0  12086.0      NaN
    12  10500.0  11497.0  11131.0  12425.0  12092.0      NaN

[204 rows x 6 columns]

In [68]:
grouped.unstack(2)

              분양가                    ...
월              1        2        3   ...       10       11       12
지역명 연도                               ...
강원  2015      NaN      NaN      NaN  ...  10897.0  10888.0  10888.0
    2016  10894.0   9013.0   9014.0  ...  10608.0  10383.0  10752.0
    2017  10711.0  10734.0  10682.0  ...  11174.0  11844.0  11736.0
    2018  12157.0  12346.0  12800.0  ...  12667.0  12611.0  12349.0
    2019  12618.0  12618.0  12706.0  ...  14027.0  14487.0  14487.0
...           ...      ...      ...  ...      ...      ...      ...
충북  2016  10518.0  10518.0  10463.0  ...  11276.0  11283.0  11497.0
    2017  11588.0  11367.0  11327.0  ...  11343.0  11131.0  11131.0
    2018  11131.0  11435.0  12212.0  ...  12494.0  12425.0  12425.0
    2019  12425.0  12158.0  12235.0  ...  12016.0  12086.0  12092.0
    2020  12092.0  12365.0  12600.0  ...      NaN      NaN      NaN

[102 rows x 12 columns]

In [72]:
pd.pivot_table(df, values='분양가', index=['연도'], columns=['월'])

월              1            2   ...           11           12
연도                              ...
2015          NaN          NaN  ...  2793.370370  2819.271605
2016  2828.493827  2836.800000  ...  3022.047619  3058.261905
2017  3059.130952  3063.904762  ...  3187.907895  3211.400000
2018  3248.226667  3262.626667  ...  3401.443038  3470.855263
2019  3495.618421  3507.513158  ...  3832.662338  3825.105263
2020  3854.013158  3853.907895  ...          NaN          NaN

[6 rows x 12 columns]

In [73]:
df['평가'] = 0
df.head(10)

  지역명               규모구분    연도   월     분양가  평가
0  서울                 전체  2015  10  5841.0   0
1  서울         전용면적 60㎡이하  2015  10  5652.0   0
2  서울   전용면적 60㎡초과 85㎡이하  2015  10  5882.0   0
3  서울  전용면적 85㎡초과 102㎡이하  2015  10  5721.0   0
4  서울        전용면적 102㎡초과  2015  10  5879.0   0
5  인천                 전체  2015  10  3163.0   0
6  인천         전용면적 60㎡이하  2015  10  3488.0   0
7  인천   전용면적 60㎡초과 85㎡이하  2015  10  3119.0   0
8  인천  전용면적 85㎡초과 102㎡이하  2015  10  3545.0   0
9  인천        전용면적 102㎡초과  2015  10  3408.0   0

In [74]:
conditions = [
    (df['분양가'] < 2387),
    (df['분양가'] >= 2387) & (df['분양가'] < 3130),
    (df['분양가'] >= 3130) & (df['분양가'] < 3383),
    (df['분양가'] >= 3383),
    (df['분양가'] == np.nan)
]
choices = ['저렴', '보통', '비쌈', '매우 비쌈', '-']
df['평가'] = np.select(conditions, choices, default=0)
df.head(20)

   지역명               규모구분    연도   월     분양가     평가
0   서울                 전체  2015  10  5841.0  매우 비쌈
1   서울         전용면적 60㎡이하  2015  10  5652.0  매우 비쌈
2   서울   전용면적 60㎡초과 85㎡이하  2015  10  5882.0  매우 비쌈
3   서울  전용면적 85㎡초과 102㎡이하  2015  10  5721.0  매우 비쌈
4   서울        전용면적 102㎡초과  2015  10  5879.0  매우 비쌈
5   인천                 전체  2015  10  3163.0     비쌈
6   인천         전용면적 60㎡이하  2015  10  3488.0  매우 비쌈
7   인천   전용면적 60㎡초과 85㎡이하  2015  10  3119.0     보통
8   인천  전용면적 85㎡초과 102㎡이하  2015  10  3545.0  매우 비쌈
9   인천        전용면적 102㎡초과  2015  10  3408.0  매우 비쌈
10  경기                 전체  2015  10  3138.0     비쌈
11  경기         전용면적 60㎡이하  2015  10  3126.0     보통
12  경기   전용면적 60㎡초과 85㎡이하  2015  10  3239.0     비쌈
13  경기  전용면적 85㎡초과 102㎡이하  2015  10  3496.0  매우 비쌈
14  경기        전용면적 102㎡초과  2015  10  3680.0  매우 비쌈
15  부산                 전체  2015  10  3112.0     보통
16  부산         전용면적 60㎡이하  2015  10  2950.0     보통
17  부산   전용면적 60㎡초과 85㎡이하  2015  10  2999.0     보통
18  부산  전용면적 85㎡초과 102㎡이하  2015  10  2957.0     보통
19  부산        전용면적 102㎡초과  2015  10  3500.0  매우 비쌈

In [75]:
df.groupby(by='평가').count()

        지역명  규모구분    연도     월   분양가
평가
0       330   330   330   330     0
매우 비쌈  1341  1341  1341  1341  1341
보통     1610  1610  1610  1610  1610
비쌈      414   414   414   414   414
저렴      895   895   895   895   895

In [76]:
df.sort_values(by='분양가', ascending=False)[:10]

     지역명               규모구분    연도   월      분양가     평가
4508  서울  전용면적 85㎡초과 102㎡이하  2020   3  13835.0  매우 비쌈
4423  서울  전용면적 85㎡초과 102㎡이하  2020   2  13835.0  매우 비쌈
4253  서울  전용면적 85㎡초과 102㎡이하  2019  12  12728.0  매우 비쌈
3998  서울  전용면적 85㎡초과 102㎡이하  2019   9  12728.0  매우 비쌈
4083  서울  전용면적 85㎡초과 102㎡이하  2019  10  12728.0  매우 비쌈
4168  서울  전용면적 85㎡초과 102㎡이하  2019  11  12728.0  매우 비쌈
3828  서울  전용면적 85㎡초과 102㎡이하  2019   7  12728.0  매우 비쌈
3743  서울  전용면적 85㎡초과 102㎡이하  2019   6  12728.0  매우 비쌈
3913  서울  전용면적 85㎡초과 102㎡이하  2019   8  12728.0  매우 비쌈
4338  서울  전용면적 85㎡초과 102㎡이하  2020   1  12728.0  매우 비쌈

In [77]:
df['평가'] = df['평가'].astype('category')
df.dtypes

지역명       object
규모구분      object
연도         int64
월          int64
분양가      float64
평가      category
dtype: object

In [79]:
df['평가'].head(10)

0    매우 비쌈
1    매우 비쌈
2    매우 비쌈
3    매우 비쌈
4    매우 비쌈
5       비쌈
6    매우 비쌈
7       보통
8    매우 비쌈
9    매우 비쌈
Name: 평가, dtype: category
Categories (5, object): ['0', '매우 비쌈', '보통', '비쌈', '저렴']

In [80]:
df['평가'].cat.categories = ['해당없음', '개비쌈', '평균', '쫌비쌈', '쌈']
df['평가'].head()

0    개비쌈
1    개비쌈
2    개비쌈
3    개비쌈
4    개비쌈
Name: 평가, dtype: category
Categories (5, object): ['해당없음', '개비쌈', '평균', '쫌비쌈', '쌈']